{
  "slug": "lu7-10th-year-anniversary-gala-dinner",
  "thumbnail_src": "lu7-10th-year-anniversary-gala-dinner.jpg",
  "created_at": "July 19, 2024",
  "category": "Blog",
  "title": "The Era of Light: Light Up 7’s 10th Year Anniversary Gala Dinner",
  "description": "We did it! Light Up 7 has officially hit its ten-year mark, and what an incredible ride it has been! On 12 July 2024, we marked this special milestone with an unforgettable celebration at The Majestic Hotel, Kuala Lumpur. The theme for the evening, “The Era of Light,” symbolised the......",
  "page_content": {
    "banner_src": "image-1.jpg",
    "html_content": "<div class='content-section'><p>We did it! Light Up 7 has officially hit its ten-year mark, and what an incredible ride it has been! On 12 July 2024, we marked this special milestone with an unforgettable celebration at The Majestic Hotel, Kuala Lumpur. The theme for the evening, “The Era of Light,” symbolised the brilliance and growth we’ve experienced over the years. It was a night filled with excitement, reflection, and a promise of even more great things to come!</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-10th-year-anniversary-gala-dinner/image-2.jpg'/></div></div><div class='content-section'><p>We kicked off the evening with some major announcements that got everyone buzzing. The highlight was the grand reveal of our new division in Sydney, Australia, marking our first international expansion.</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-10th-year-anniversary-gala-dinner/image-3.jpg'/></div></div><div class='content-section'><p>We also proudly unveiled our fresh rebranding— a bold new look that reflects our evolving identity and the bright future ahead. It's amazing to see how far we've come, and we’re thrilled for the new opportunities these changes will bring.</p></div><img class='width-square' src='/images/news/lu7-10th-year-anniversary-gala-dinner/image-4.jpg'/><div class='content-section'><p>One of the most touching moments of the night was when we took the time to honour our OG team members— the heart and soul of Light Up 7. Special recognition was given to the first and longest-serving employees, whose dedication, passion, and hard work have been instrumental in our success. To these amazing individuals, we offer our deepest congratulations and heartfelt thanks.</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-10th-year-anniversary-gala-dinner/image-5.jpg'/></div></div><div class='content-section'><p>Of course, it wasn’t all about speeches and formalities! We made sure the evening was full of fun and excitement for all our guests. A best-dressed competition kept the glamour flowing, with attendees sporting their finest outfits. The lucky draw, packed with incredible prizes such as a PS5, vacuum robot, and projector, had everyone on the edge of their seats. But the best was yet to come! The night culminated in thrilling performances by our talented team, leaving everyone in awe.</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-10th-year-anniversary-gala-dinner/image-6.jpg'/></div></div><div class='content-section'><p>As we look back at the past ten years, we can’t help but feel proud of how far we’ve come. From our humble beginnings to becoming a leading force in the industry, we’ve learned, grown, and celebrated every step of the way. But this is just the beginning— with so much more on the horizon, we’re ready to embrace the next chapter of Light Up 7.</p><p>If you’re as excited as we are about the journey ahead, we’d love for you to join us. Let’s get creative together and make the next decade even more remarkable!</p></div><div class='content-section'><p><strong>Cheers to Light Up 7— the best is yet to come!</strong></p></div>"
    }
}