{
  "slug": "lu7-prestigious-agency-award-2022",
  "thumbnail_src": "lu7-prestigious-agency-award-2022-thumbnail.png",
  "created_at": "Aug 17, 2022",
  "category": "Blog",
  "title": "Light Up 7 Bags 4 Awards at Prestigious Agency of the Year and MARKIES Awards 2022",
  "description": "What a night! Light Up 7 is humbled (and incredibly proud) to have won 4 awards at the Agency of the Year and MARKIES 2022 Awards 🙌 Light Up 7 bagged 4 awards, much to our excitement. Definitely making room on our shelves now! It was an honour to have been considered finalists, especially considering who we were going up against.....",
  "page_content": {
    "banner_src": "banner.png",
    "html_content": "<div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-prestigious-agency-award-2022/image-1.png' /></div></div><div class='content-section'><p>What a night! Light Up 7 is humbled (and incredibly proud) to have won 4 awards at the Agency of the Year and MARKIES 2022 Awards 🙌 Light Up 7 bagged 4 awards, much to our excitement. Definitely making room on our shelves now! It was an honour to have been considered finalists, especially considering who we were going up against, but even more so to have won in the following categories:</p><div class='multiline-no-space-container'><p>Agency Team of the Year</p><p>Event Marketing Agency of the Year</p><p>Markies for Most Effective Use: Events (Physical/Virtual)</p><p>Video / Production Company of the Year</p></div></div><div class='image-container'><img class='width-square' src='/images/news/lu7-prestigious-agency-award-2022/image-2.png' /><p class='caption'>The team who have got your back (and your project's!)</p></div><div class='content-section'><p>These awards not only speak of the quality of effective and creative work that Light Up 7 produces, but also the dedication, expertise and professionalism of our team behind these amazing projects. Some of these projects were done while the pandemic was in full swing and the team worked from the challenging home environment, and some of these projects required creative solutions that required a massive team. And yet, we bagged these incredible testaments to our hard work and dedication, go team!</p><p>With these awards, you'll get no better testimonials regarding our capabilities and willingness to go further on every project that lands on our desk. But we couldn’t do it alone: we’d also like to take this opportunity to also thank our clients and partners who not only believed in our vision and passion, but also helped us become better and braver with our work.</p></div><div class='image-container'><img class='width-square' src='/images/news/lu7-prestigious-agency-award-2022/image-3.png' /></div><div class='content-section'><p>We hope to bag even more awards in the future, and your project could be the next award-winning brief. Ready to work with us?</p></div>"
  }
}