{
  "slug": "lu7-bull-award-2024",
  "thumbnail_src": "lu7-bull-award-2024.jpg",
  "created_at": "Aug 5, 2024",
  "category": "Blog",
  "title": "Light Up 7 Wins Outstanding Bull Award at 2024 Golden Bull Awards: A Step Toward Greater Success",
  "description": "We did it again! Light Up 7 won the Outstanding SMEs Award at the 2024 Golden Bull Awards, and we are so proud. The award was bestowed by YB Tuan Mohd Rafizi Bin Ramli, Minister of Economy, and it’s such an honour for us. This being our very first Golden Bull Award makes it even more special, and acknowledges all our determination, dedication, and hard work......",
  "page_content": {
    "banner_src": "banner.jpg",
    "html_content": "<div class='content-section'><p>We did it again! Light Up 7 won the Outstanding SMEs Award at the 2024 Golden Bull Awards, and we are so proud. The award was bestowed by YB Tuan Mohd Rafizi Bin Ramli, Minister of Economy, and it’s such an honour for us. This being our very first Golden Bull Award makes it even more special, and acknowledges all our determination, dedication, and hard work.</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-bull-award-2024/image-1.png'/></div></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-bull-award-2024/image-2.jpg'/></div></div><div class='content-section'><blockquote><p><em>“Winning the Golden Bull Award is a testament to Light Up 7’s hard work. This recognition and our upcoming 10-year anniversary marks significant milestones in our journey.”</em><p><strong><em>Usaid Ghassan, CEO of Light Up 7</em></strong></p></blockquote></div><p>Over the years, we've faced our share of challenges, but thanks to our amazing team and a focus on hiring the right talent, we have overcome those ups and downs like pros. In just ten years, we've managed to grow fast and adapt to the ever-changing industry, all while delivering incredible results for our clients.</p><p>This win means a lot to us! It shows all the hard work and dedication we've put in as a team, proving we're on the right path. It's not just about the trophy—it's about our journey and how far we've come together. Big shoutout to our awesome team and fantastic clients who made this happen. We couldn’t have done it without you!</p><p>It's been a busy 2024 for us! But we're just getting started and we can't wait to get inspired, get creative and take on even bigger opportunities!</p><p>So, whether you're a business looking to boost your online presence or a professional on the hunt for a rewarding career, Light Up 7 has what you need. Don't hesitate to reach out!</p></div><div class='content-section'><p>Read more about our win on the <a href='https://goldenbullaward.com/winners/my-hall-of-fame/malaysia-2024/'>Golden Bull Awards Hall of Fame</a>.</p></div>"
  }
}