{
  "slug": "lu7-dragon-award-2024",
  "thumbnail_src": "lu7-dragon-award-2024.png",
  "created_at": "Oct 21, 2024",
  "category": "Blog",
  "title": "2024 Dragons of Malaysia: Light Up 7 Scores With Multiple Wins!",
  "description": "Light Up 7 absolutely crushed it at the 2024 Dragons of Asia! We’re super excited to share some awesome wins that showcase all the hard work and creativity our team poured into these past projects.....",
  "page_content": {
    "banner_src": "banner.png",
    "html_content": "<div class='content-section'><p>Light Up 7 absolutely crushed it at the 2024 Dragons of Asia! We’re super excited to share some awesome wins that showcase all the hard work and creativity our team poured into these past projects.</p></div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/lu7-dragon-award-2024/image-1.jpg' /></div></div><div class='content-section'><p>We nabbed a Gold Dragon of Malaysia for our Bangkit Bersama Melawan Scammer campaign with Bank Negara Malaysia in the Best Cause, Charity Marketing, or Public Sector Campaign category! What a win! The campaign was all about raising awareness about scams, urging Malaysians to unite against a common foe during this digital era. It feels great to know we’re making a real difference in people’s lives and spreading the word among Malaysians.</p></div><div class='image-container'><img class='width-square' src='/images/news/lu7-dragon-award-2024/image-2.jpg'/></div><div class='content-section'><p>Next, our Connecting Horizons, Empowering Journeys campaign for KTMB earned us the Silver Dragon in the Best Business-to-Business or Trade Marketing Campaign category! It's a memorable experience for us to be able to capture the very essence of a long-standing legacy brand. (Plus points: We got to travel all over Peninsular Malaysia for it!).</p><p>We’ve also picked up some Black Dragons in the other categories we were shortlisted for, which helped us secure a spot as one of the Top 5 agencies in Malaysia at the Dragons of Asia Awards!</p></div><div class='image-container'><img class='width-square' src='/images/news/lu7-dragon-award-2024/image-3.png' /></div><div class='content-section'><p>While we’re all stoked about these awards, the real win is the trust and confidence our clients have in us, and that’s what really matters. Kudos to our team! Cheers to even more victories ahead!</p><p>If you’re seeking a creative partner to help you reach your goals, we’d love to chat. And if you’re thinking about joining our team, we’re always on the lookout for talented, passionate folks—check out our <a href='https://www.lightup7.com/careers/'>careers page</a>!</p></div><div class='image-container'><img class='width-square' src='/images/news/lu7-dragon-award-2024/image-4.jpg' /></div>" 
     }
}