{
  "slug": "meeting-families-halfway-raya-pnb-asnb",
  "thumbnail_src": "pnb-asnb-thumbnail.jpg",
  "created_at": "April 5, 2024",
  "category": "Blog",
  "title": "Meeting Our Families Halfway This Raya with PNB & ASNB.",
  "description": "One of the things to look forward to during the Raya season would be the cinematic short films and ads that flood social media and our TV screens. For Light Up 7, our addition to this vibrant season comes in the form of our collaboration with Permodalan Nasional Berhad (PNB) and Amanah Saham Nasional Berhad (ASNB) to produce a.....",
  "page_content": {
    "banner_src": "banner.png",
    "html_content": "<div class='content-section'><p>One of the things to look forward to during the Raya season would be the cinematic short films and ads that flood social media and our TV screens. For Light Up 7, our addition to this vibrant season comes in the form of our collaboration with Permodalan Nasional Berhad (PNB) and Amanah Saham Nasional Berhad (ASNB) to produce a cinematic TVC for Raya 2024. Upon receiving the brief, we knew we wanted to tell a story about Raya, family, and forgiveness from a fresh yet relatable angle.</p><.div><div class='content-section'><div class='image-container'><img class='width-square' src='/images/news/meeting-families-halfway-raya-pnb-asnb/image-1.png' /></div></div><div class='content-section'><p>So we dove into the trove of Raya videos of yesteryears, where there’s a wealth of depictions of real-life family dynamics and relatable experiences. On top of that, we noticed emergent themes in mainstream media and pop culture about generational trauma, parents introspecting, and how a family becomes stronger when a parent meets a child halfway. Thus, we crafted an ad to tell the story of the tense relationship between a father and his son, longing for the tenderness he’s showing to his grandson during Raya.</p></div><div class='image-container'><img class='width-square' src='/images/news/meeting-families-halfway-raya-pnb-asnb/image-2.png' /></div><div class='content-section'><p>Balang Kuih Abah tells the tale of Pak Hisham, a traditional kuih baker, who adores his grandson Danish. His son Farhan, however, feels pained watching their close-knit bond, which is a contrast to his relationship with Pak Hisham over the past 30 years. Tension rises the night before Raya and old wounds open up. Could Pak Hisham mend the strained, almost broken bond between him and his only son, Farhan?</p><p>Well, you’d have to <a href='https://www.youtube.com/watch?v=VH9bqqHijJQ' target='_blank'>watch the video </a> yourself to find out!</p></div><div class='image-container'><img class='width-square' src='/images/news/meeting-families-halfway-raya-pnb-asnb/image-3.png' /></div><div class='content-section'><p>Our creative team tackled this project with joint efforts from the video production, content writing, and motion graphics teams to produce an ad that’s heartfelt, cinematic, and engaging by being inspiring, trendy, and thematically on point with the festive season. Only then can the message of taking every small step towards building a brighter tomorrow—aligning with the brand’s core philosophy—be delivered and received effectively.</p><p>See the magic for yourself here:</p></div><div class='video-container'style='display: flex; justify-content: center;'><iframe width='560' height='315' src='https://www.youtube.com/embed/VH9bqqHijJQ' frameborder='0' allowfullscreen></iframe></div><div class='content-section'><p>In short, every step of the process was a wonderful experience for the Light Up 7 team. Knowing we managed to touch people’s hearts with this Raya ad is immensely gratifying for us.</p><p>Light Up 7 wishes you a joyous and blessed Eid with your loved ones. Selamat Hari Raya Aidilfitri!</p><p>If our expertise in cinematic storytelling piqued your interest, <a href='mailto:info@lightup7.com'>reach out to us</a>, and we’ll bring your ideas to life!</p></div>"
  
   }
}