{
  "slug": "sme-100-awards",
  "thumbnail_src": "sme-100-thumbnail.png",
  "created_at": "Feb 3, 2023",
  "category": "Blog",
  "title": "SME1OO Awards: Light Up 7 Takes The Win",
  "description": "Light Up 7 has achieved yet another triumph! From sweeping the MARKIES 2022 Awards, to The Bizz Awards, we have now managed to pocket the SME100 Awards!We are immensely proud to be recognized by SME100, a prestigious and influential voice amongst potential clients, partners and investors....",
  "page_content": {
    "banner_src": "banner.png",
    "html_content": "<div class='content-section'><p>Light Up 7 has achieved yet another triumph! From sweeping the MARKIES 2022 Awards, to The Bizz Awards, we have now managed to pocket the SME100 Awards!</p> <p>We are immensely proud to be recognized by SME100, a prestigious and influential voice amongst potential clients, partners and investors. Achieving this recognition from SME100 has set the bar for us to push harder and take bigger climbs in 2023. Despite all the awards we have achieved the past year, the biggest one yet is the trust and confidence that our clients have put into Light Up 7 to produce only the best for their brands.</p></div><div class='content-sectionn'><div class='image-container' /><img src='/images/news/sme-100-awards/image-1.png' /><p class='caption'>Light Up 7's CEO Usaid Ghassan and COO Qutayba Ghassan during SME100 Awards interview</p></div><p class='bold-text'>The company has grown multifolds, and it's really putting us on the map. - CEO Usaid Ghassan</p><p>Light Up 7's CEO, Usaid Ghassan expressed his gratitude for the recognition from this prestigious brand which will play a big role in the company striving from here on out. Not to forget, this award is also the culmination of hard work and dedication from our team, putting nothing but their best forward in every aspect. A well deserved Kudos to the team! </p></div><div class='content-section'><div class='image-container' /><img src='/images/news/sme-100-awards/image-2.png'</div><div class='content-section'><p>Watch out 2023, Light Up 7 is ready to take you by storm!</p><a href='https://sme100.asia/event/hall-of-fame-2022/malaysia-2022/light-up-7-sdn-bhd-2022' target='_blank'><p>https://sme100.asia/event/hall-of-fame-2022/malaysia-2022/light-up-7-sdn-bhd-2022/</p></a></div></div>"
  }
}