{
  "title": "Accounts Executive",
  "slug": "accounts-executive",
  "category": ["finance"],
  "description_html": "<p>We are looking for a meticulous and proactive Accounts Executive to support the finance team in managing daily accounting operations, ensuring accurate financial reporting, and maintaining proper documentation in line with company policies and regulatory standards. This role requires a strong foundation in accounting principles, attention to detail, and the ability to work independently in a fast-paced environment.</p><p>We work with clients to provide creative solutions to grow their business through media advertising and fun projects. You will manage, process and troubleshoot various accounts and transactions. Ultimately, you will help sustain, monitor our company’s financial health and ensure our resources are utilized beneficially.</p>",
  "responsibilities": [
    "Handle full spectrum of accounting functions including Accounts Receivable (AR), Accounts Payable (AP), and General Ledger (GL).",
    "Prepare and process invoices, payment vouchers, receipts, and claims in a timely and accurate manner.",
    "Ensure proper maintenance of accounting records, documentation, and filing systems for audit and compliance purposes.",
    "Monitor daily transactions and ensure accurate data entry and general bookkeeping.",
    "Assist in the preparation of monthly, quarterly, and annual financial reports and management accounts.",
    "Perform bank reconciliations and follow up on outstanding items.",
    "Track and manage petty cash and staff reimbursements.",
    "Assist in budget preparation and financial forecasting.",
    "Liaise with auditors, tax agents, and other relevant parties during audit or tax filing exercises.",
    "Ensure compliance with statutory requirements and accounting standards.",
    "Support Finance Manager with ad-hoc financial analysis and tasks as required."
  ],
  "desired_skills": [
    "Diploma/Degree in Accounting, Finance, or a related field.",
    "Minimum 1–3 years of working experience in a similar accounting role.",
    "Proficient in Microsoft Excel and accounting software (e.g., SQL, QuickBooks, Xero, or similar).",
    "Solid understanding of financial regulations and accounting principles.",
    "Strong attention to detail and high level of accuracy.",
    "Good organizational and time-management skills.",
    "Ability to handle confidential information with integrity.",
    "Strong interpersonal and communication skills.",
    "Able to work independently and collaboratively in a team setting.",
    "Proactive, self-motivated, and able to meet tight deadlines."
  ]
}