{
    "title": "Art Director",
    "slug": "art-director",
    "category": ["creative"],
    "description_html": "<p>At our fast-paced, progressive digital agency we work with large, well-known brands and growing businesses to deliver compelling, ROI-driven marketing campaigns that create significant results.</p><p>We are looking for a talented and visionary Art Director, you will be responsible to shape and execute all our client’s creative objectives. You will collaborate closely with cross-functional departments, driving creative concepts, and projects and ensuring the highest level of quality in all our creative endeavours.</p><p>Join Light Up 7 and become an integral part of our team as we continue to deliver exceptional creative solutions and make a lasting impact on our clients' businesses!</p>",
    "responsibilities": [
      "Develop and execute innovative creative strategies that align with clients' marketing objectives, target audience, and brand guidelines.",
      "Generate original and captivating visual concepts for digital campaigns, social media content, website designs, email marketing, and other digital channels.",
      "Oversee the whole process of the creation of visual assets, including graphics, copy, content, photography, and videos, ensuring they meet high standards of quality, creativity, and brand consistency.",
      "Collaborate closely with the team of designers, copywriters, digital marketers, and project managers to ensure cohesive execution and delivery of client projects.",
      "Engage with clients to understand their vision, provide creative recommendations, and present visual concepts that align with their brand and marketing goals.",
      "Stay up-to-date with the latest design trends, digital marketing strategies, and emerging technologies to drive innovation and ensure the agency remains at the forefront of the industry.",
      "Develop creative briefs based on ideas from brainstorming sessions, with direction, schedules, and deliverables for the creative team",
      "Oversee presentation and approval of final creative concepts and coordinate production in all aspects"
    ],
    "desired_skills": [
      "Bachelor’s degree (or equivalent) in art, graphic design, video, or any creative disciplines",
      "3-5+ years as an Art Director or in any similar creative role within digital creative agencies.",
      "Strong portfolio showcasing a range of digital creative work across various platforms.",
      "Proficiency in creative software and tools such as Adobe Creative Suite.",
      "Strong leadership skills with the ability to guide and inspire a creative team.",
      "Effective communication and presentation skills to effectively collaborate with clients and internal teams.",
      "Ability to multitask, manage multiple projects simultaneously, and meet tight deadlines.",
      "Highly skilled in leading a team of creatives.",
      "Strong creative vision with attention to business objectives."
    ]
}