{
  "title": "Asset Management Specialist",
  "slug": "asset-management-specialist",
  "category": ["technology"],
  "description_html": "<p>We are looking for a proactive and detail-oriented Asset Management Specialist to support the daily operations of our IT & Technology Department.</p><p>This role plays a key part in ensuring smooth technical operations across the company by maintaining hardware, software systems, overseeing all company assets, and supporting the team with troubleshooting and documentation.</p><p>Fresh graduates are encouraged to apply!</p>",
  "responsibilities": [
    "Provide day-to-day technical support for hardware, software, and network-related issues within the company.",
    "Install, configure, and maintain all company assets including desktops, laptops, printers, routers, any company equipment etc.",
    "Support system updates, software installations, and basic network maintenance.",
    "Create and maintain documentation for IT procedures, equipment usage guides, and asset logs.",
    "Assist with user access setup for new staff (computer, server access, etc.).",
    "Maintain and manage the company’s asset inventory.",
    "Track asset movement and ensure proper check-in/check-out documentation for internal and external usage.",
    "Support technical requirements for events and on-site activations, including equipment setup, testing, and troubleshooting.",
    "Liaise with third-party vendors and service providers for repairs, procurement, or project-specific needs.",
    "Perform on-site troubleshooting and maintenance.",
    "Assist with ad-hoc related tasks as assigned."
  ],
  "desired_skills": [
    "Bachelor’s degree in Information Technology, Computer Science, or any related field.",
    "1–2 years of relevant experience in asset management, IT support or technical assistant roles is an advantage.",
    "Proficient in English and Malay (spoken and written).",
    "Familiarity with both Windows and Mac operating systems, Microsoft Office Suite, Google Workspace, and basic networking.",
    "Strong troubleshooting and diagnostic skills — especially under time-sensitive or event-related conditions.",
    "Detail-oriented with solid organizational and documentation skills.",
    "Good communication and interpersonal skills to support both technical and non-technical teams.",
    "Willingness to learn new tools and systems as the company evolves.",
    "Possesses own car and is able to drive (for offsite or event-based support)."
  ]
}