{
  "title": "Business Development Executive",
  "slug": "business-development-executive",
  "category": ["client services"],
  "description_html": "<p>We are searching for talented and enthusiastic individuals to advance the growth of our business in the world of digital marketing. We work with clients to provide creative solutions to grow their business through media advertising and fun projects. Keeping an eye on client’s feedback, you will be able to ensure that they are satisfied with the services we provide. You are an out-of-the-box thinker and want to challenge the status quo!</p>",
  "responsibilities": [
    "Identifying and researching business opportunities that come up in new or existing markets.",
    "Communicating with clients to understand their needs and offer customized solutions to their problems.",
    "Attracting new clients by innovating and formulating advertising solutions for their business.",
    "Holding presentations and insightful pitches to attract potential clients.",
    "Preparing tailored proposals and quotations for potential clients.",
    "Assist in the Procurement process to register our company as a vendor.",
    "Following up with current and future clientele to offer marketing solutions to their problems.",
    "Collecting and analyzing current trends in the media to gather market information to identify opportunities to grow.",
    "To work closely with superiors in handling or attending any other duties relating to Business Development which may be assigned from time to time.",
    "Assisting superior in completing ad-hoc tasks & projects."
  ],
  "desired_skills": [
    "Bachelor’s degree in business, marketing or any related field.",
    "Experience in sales, marketing, business development or any related industries.",
    "Strong communication and negotiation skills.",
    "Ability to manage complex projects and multi-task.",
    "Excellent organizational skills and time management skills.",
    "Understanding of market research and analysis techniques.",
    "Independent, strong networking and relationship-building skills.",
    "Proficient in Microsoft Word, Excel, Outlook, and PowerPoint."
  ]
}
