{
  "title": "Business Administrator",
  "slug": "business-administrator",
  "category": ["client services"],
  "description_html": "<p>We are looking for a proactive and detail-oriented Business Administrator to support the daily operations of the office and provide essential assistance to the Business Development Department. This role plays a key part in ensuring administrative efficiency, coordinating communication, assisting and contributing to the successful execution of projects, proposals, and client engagements.</p><p>Fresh graduates are encouraged to apply as well — we value enthusiasm, willingness to learn, and a strong work ethic!</p>",
  "responsibilities": [
  "Provide administrative and operational support to the Business Development Department.",
  "Organize and maintain accurate records, files, and both physical and digital databases.",
  "Complete and submit internal and external forms, applications, and supporting documentation in a timely manner.",
  "Manage departmental correspondence, emails, calendars, appointments, and meeting schedules.",
  "Prepare detailed reports, professional presentations, and supporting documentation for both internal and external meetings.",
  "Participate in client briefings and meetings to provide support and gather information for follow-up actions.",
  "Assist in the preparation, formatting, and compilation of business proposals and tender documents.",
  "Respond to incoming phone calls and provide prospective clients with a concise overview of the company’s services.",
  "Coordinate communication and collaboration between departments to optimize workflow and project execution.",
  "Support planning and execution of internal and external projects as required.",
  "Draft, review, and distribute internal memos based on client meetings and briefing sessions, ensuring accurate and timely communication of key information to the Business Development Department.",
  "Assist in overseeing document dispatch as required.",
  "Provide support with ad-hoc tasks as required by management."
  ],
"desired_skills": [
  "Bachelor’s degree in Business Administration, Management, or any related field.",
  "1-2 years of relevant experience in an administrative or business support role.",
  "Proficient in English and Malay (spoken and written).",
  "Proficient in Microsoft Office Suite, Google Workspace, and any project management tools.",
  "Strong organizational and time-management skills.",
  "Excellent written and verbal communication abilities.",
  "Detail-oriented with strong problem-solving skills.",
  "Possesses own car and is able to drive."
  ]
}
