{
    "title": "Creative Content Writer",
    "slug": "creative-content-writerr",
    "category": ["content"],
    "description_html": "<p>Light Up 7 is on the lookout for a talented and imaginative writer to join our dynamic marketing team. Our fast-paced, forward-thinking brand activation agency collaborates with renowned brands and burgeoning businesses to deliver captivating, ROI-focused marketing campaigns that yield substantial results.</p><p>We are seeking a creative wordsmith who embodies both passion and proficiency, boasting impeccable English and Bahasa Malaysia skills. The ideal candidate will have a track record of at least 2 years in the field and exhibit strong critical thinking abilities, along with an exceptional knack for thriving in a fast-paced, team-oriented environment. Show off those writing portfolios and creative writing samples today!</p>",
    "responsibilities": [
      "Craft compelling, well-researched content creation and articles.",
      "Head the project proposal creation, content ideation process, and have a deep understanding of client briefs.",
      "Deliver insightful pitches and presentations to potential clients based on the content created.",
      "Develop and oversee the creation of storyboards, scripts, ensuring a clear and engaging visual narrative.",
      "Utilize AI software and tools effectively, including crafting detailed prompts to generate creative, high-quality, and relevant content for various projects.",
      "Conduct thorough research, develop creative ideas, and perform extensive fact-checking tailored to the content and topic.",
      "Conceptualize and develop creative stories that captivate audiences and align with project objectives.",
      "Identify and leverage current trends to drive strategic content marketing.",
      "Develop an in-depth understanding of our target groups and tailor messages to suit different audiences through creative storytelling.",
      "Formulate catchy and creative messages for use in all media such as marketing campaigns, promotions, and activities.",
      "Assess, modify, and adapt key messages to align with various media channels, both online and offline.",
      "Maintain strict adherence to deadlines, ensuring the timely completion of assigned projects.",
      "Prepare content and craft copy for various social media platforms.",
      "Demonstrate proficiency in SEO techniques for website optimization.",
      "Perform other related tasks as needed."

    ],
    "desired_skills": [
      "Candidate must possess at least a Professional Certificate, Diploma, or Bachelor’s degree in Mass Communications, Public Relations, Journalism, English, or relevant degree or certification.",
      "2-4 years’ experience in creative writing industry.",
      "Ability to write in a wide range of tone and manner according to client’s industry.",
      "Able to work hand-in-hand with project managers, designers, and developers.",
      "Concise and innovative writing and editing skills.",
      "Excellent writing skills, as well as the ability to communicate and collaborate effectively.",
      "Impeccable spelling and grammar.",
      "Experience and familiarity with online marketing, content marketing, and demand generation best practices.",
      "Great research and organisational capabilities.",
      "Ability to learn quickly and work at a fast pace.",
      "Interest in and understanding of technology and business.",
      "Knowledge of digital marketing tactics, including SEO, email marketing and web analytics.",
      "Strict adherence to deadlines.",
      "Candidate must possess impeccable command of English and Bahasa Malaysia."
    ]
}