{
  "title": "Digital Marketing Executive",
  "slug": "digital-marketing-executive",
  "category": ["marketing"],
  "description_html": "<p>At our fast-paced, progressive brand activation agency we work with large, well-known brands and growing businesses to deliver compelling, ROI-driven marketing campaigns that create significant results.</p><p>We are looking for a team player who is both passionate and has experience with digital marketing. The ideal candidate will have 1–2 years of experience and strong critical thinking skills with an exceptional ability to collaborate in a fast-paced, team-oriented environment. You should have a strong grasp of current marketing tools and strategies.</p><p>Digital marketing executives will work with the marketing team, supporting teams and vendors to launch campaigns on time and on budget.</p>",
  "responsibilities": [
    "- Plan and execute digital marketing, including SEO/SEM, marketing database, email, social media and display advertising campaigns.",
    "- Assist in designing, building and maintaining our social media presence.",
    "- Measure and report performance of all digital marketing campaigns, and assess against goals (ROI and KPIs).",
    "- Identify trends and insights, and optimize spend and performance based on the insights.",
    "- Brainstorm new and creative growth strategies.",
    "- Assist in planning, executing, and measuring experiments and conversion tests.",
    "- Collaborate with clients and other vendor partners.",
    "- Utilize strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch points.",
    "- Instrument conversion points and optimize user funnels.",
    "- Collaborate with agencies and other vendor partners.",
    "- Assist in researching and engaging with KOLs / Content Publishers.",
    "- Assist in monthly-end digital marketing reports."
  ],
  "desired_skills": [
    "Degree in marketing or a related field.",
    "Proven working experience in digital marketing.",
    "Experience managing SEO/SEM, marketing database, email, social media and/or display advertising campaigns.",
    "Highly creative with experience in identifying target audiences.",
    "Experience in optimizing landing pages and user funnels.",
    "Knowledge of website analytics tools (e.g., Google Analytics, Social Media Analytics, YouTube Analytics, SEMrush for SEO).",
    "Working knowledge of ad serving tools.",
    "Any experience in setting up and optimizing Google Ads and GDN campaigns.",
    "Strong analytical skills and data-driven thinking.",
    "Up-to-date with the latest trends and best practices in online marketing and measurement."
  ]
}
