{
    "title": "Event Account Manager",
    "slug": "event-account-manager",
    "custom_layout": true,
    "location": "Kuala Lumpur (Required to travel for events)",
    "about_company": "Light Up 7 is a full-service creative agency driven by innovation, strategy, and the pursuit of impactful brand experiences. As the parent company of Sevenue, we bring together cutting-edge marketing with immersive event execution, from high-profile corporate functions and media launches to large-scale conferences, exhibitions, and experiential activations. Through Sevenue, we specialize in planning and executing end-to-end event solutions that help brands connect meaningfully with their audience, both online and on-ground. Our combined teams offer powerful ideas, fast execution, and memorable results for some of Malaysia’s top brands and organizations.",
    "about_role": "We're looking for a skilled and client-focused Event Account Manager to lead the management of event projects from brief to execution. You’ll be the vital link between our clients and internal teams, ensuring project success through clear communication, timely execution, and unforgettable event experiences. This role is best suited for someone who thrives in a fast-paced environment, enjoys juggling multiple client accounts, and can confidently lead project timelines, proposals, and client communications, while partnering closely with our operations team who handles vendor sourcing and execution logistics.",
    "responsibilities": [
      "<strong>Client Management & Strategic Servicing:</strong><br> - Act as the key point of contact for clients throughout the creative and execution process.<br> - Understand client goals, translate them into actionable event briefs, and provide guidance throughout the project lifecycle.<br> - Present and refine creative proposals based on client feedback, maintaining trust-based relationships.<br> - Handle post-event follow-ups and maintain ongoing rapport with key clients.<br><br>",
      "<strong>Event Project Leadership:</strong><br> - Lead and work together with the ops team to manage end-to-end execution of corporate events: conferences, seminars, activations, exhibitions, fairs, forums, brand launches, and more.<br> - Oversee production timelines, budgets (in collaboration with finance), and team coordination.<br> - Troubleshoot on-site issues and ensure smooth flow of event operations alongside the ops team.<br> - Support and guide the development of creative decks for pitching and proposals.<br><br>",
      "<strong>Internal Coordination:</strong><br> - Work closely with internal teams (designers, 3D visualizers, video/content producers) to align deliverables with the creative vision.<br> - Coordinate with the event operations team, who will handle sourcing of vendors (AV, lighting, décor, etc.) to execute the concept seamlessly.<br> - Maintain detailed documentation for each project and ensure all deadlines are met."
    ],
    "job_requirements": [
      "2-4+ years of experience in event/project management, agency work, or client servicing.",
      "Strong attention to detail and ability to multi-task under pressure.",
      "Excellent interpersonal and communication skills (written & spoken).",
      "Decision-making and problem-solving skills are a must, especially in fast-turnaround situations.",
      "Ability to continuously bring fresh, innovative ideas to elevate event experiences.",
      "Skilled in Google Suite (Slides, Sheets, Docs) and Microsoft Office.",
      "Must be passionate about creating memorable and engaging event experiences.",
      "Able to travel and work outside regular hours based on event schedules (evenings/weekends).",
      "Possess own transport and physical stamina for on-site coordination.",
      "Languages: Proficient in English, Bahasa Malaysia & Mandarin (for liaison purposes).",
      "Willing to work under pressure, accept new challenges, and adapt quickly."
    ],
    "bonus_skills": [
      "Exposure to brand campaigns, digital content development, or media strategy.",
      "Experience in conceptual or creative direction (a big plus)."
    ]
  }
  