{
    "title": "Event Production Manager",
    "slug": "event-production-manager",
    "category": ["events"],
    "description_html": "<p>We work with a wide range of clients to create bold, results-driven solutions through immersive brand experiences. We are looking for an experienced Event Production Manager to plan, manage, and deliver high-quality events such as corporate conferences, brand activations, exhibitions, and product launches. You will be responsible for managing event logistics, technical production, and team coordination, ensuring each event runs smoothly, on time, and exceeds client expectations.</p>",
    "responsibilities": [
        "<strong>Event Planning & Coordination:</strong><br> - Partner with clients to define event objectives, concepts, budgets, and timelines.<br> - Develop and execute detailed event production plans covering logistics, schedules, and deliverables.<br> - Manage and negotiate with local vendors and suppliers (venues, AV, staging, lighting, catering, etc.) to secure best value and service.",
        
        "<strong>Event Production & On-Site Management:</strong><br> - Take full ownership of the event floor, acting as the show caller / stage manager to run all projects from start to finish.<br> - Lead all technical aspects of production including staging, lighting, sound, multimedia, and livestreaming.<br> - Oversee rehearsals, event setups, live event flow, and dismantling to ensure smooth operations.<br> - Serve as the primary point of contact for vendors, clients, and crew during event execution.<br> - Troubleshoot and resolve on-site issues quickly, maintaining seamless event delivery.",
        
        "<strong>Team & Budget Management:</strong><br> - Lead, motivate, and coordinate internal staff, freelancers, and on-ground crew to execute their roles effectively.<br> - Delegate responsibilities clearly and give real-time direction to crew during rehearsals and live events.<br> - Manage event budgets, track expenses, and ensure financial accountability.<br> - Prepare and present progress updates, production reports, and post-event evaluations to stakeholders.",
        
        "<strong>Marketing & Event Support:</strong><br> - Work closely with creative and marketing teams to integrate branding and event campaigns.<br> - Oversee and approve event-related materials such as invitations, stage designs, signage, and digital/social media content."
    ],
    "desired_skills": [
        "3-5+ years’ experience in event management or event production.",
        "Experience in managerial/leadership roles.",
        "Strong organizational, project management, and multitasking abilities.",
        "Excellent communication, leadership, and negotiation skills.",
        "Knowledge of technical event production (sound, lighting, staging, AV, livestreaming).",
        "Proficiency in Microsoft Office, Google Suite, and Adobe software.",
        "Budgeting and financial management experience.",
        "Flexibility to work evenings, weekends, and holidays as required.",
        "Must have own transport and valid driver’s license."
    ]
}
