{
    "title": "Event Production Manager",
    "slug": "event-production-manager",
    "category": ["events"],
    "description_html": "<p>We work with a wide range of clients to create bold, results-driven solutions through immersive brand experiences. We are looking for an experienced Event Production Manager to plan, manage, and deliver high-quality events such as corporate conferences, brand activations, exhibitions, and product launches. You will be responsible for managing event logistics, technical production, and team coordination, ensuring each event runs smoothly, on time, and exceeds client expectations.</p>",
    "responsibilities": [
        "Partner with clients to define event objectives, concepts, budgets, and timelines.",
        "Develop and execute detailed event production plans covering logistics, schedules, and deliverables.",
        "Manage and negotiate with local vendors and suppliers (venues, AV, staging, lighting, catering, etc.) to secure best value and service.",
        "Take full ownership of the event floor, acting as the show caller / stage manager to run all projects from start to finish.",
        "Lead all technical aspects of production including staging, lighting, sound, multimedia, and livestreaming.",
        "Oversee rehearsals, event setups, live event flow, and dismantling to ensure smooth operations.",
        "Serve as the primary point of contact for vendors, clients, and crew during event execution.",
        "Troubleshoot and resolve on-site issues quickly, maintaining seamless event delivery."
    ],
    "desired_skills": [
        "3-5+ years of experience in event production or event management.",
        "Proven track record in managing large-scale events from concept to execution.",
        "Strong knowledge of event logistics, AV systems, staging, lighting, and production workflows.",
        "Excellent organizational and time management skills.",
        "Ability to lead teams and coordinate multiple stakeholders effectively.",
        "Strong problem-solving skills and ability to perform under pressure.",
        "Excellent communication and interpersonal skills."
    ]
}
