{
    "title": "Finance & Accounting Executive",
    "slug": "finance-accounting-executive",
    "description_html": "<p>We are searching for a highly organized and detail-oriented finance & accounting assistant to join our finance team. Extensive knowledge of general accounting and bookkeeping practices is essential. You will assist with the day-to-day tasks in our finance department. You will play an integral role in maintaining the company's account information.</p><p>We work with clients to provide creative solutions to grow their business through media advertising and fun projects. Working closely with the finance manager, you will manage, process and troubleshoot various accounts and transactions. Ultimately, you will help sustain, monitor our company’s financial health and ensure our resources are utilized beneficially.</p>",
    "responsibilities": [
        "Manage data, records, and reports by checking for errors and verifying accuracy of financial information.",
        "Prepare receipts, invoices, for entry into data sheets.",
        "Assist in preparation of financial statements and reports.",
        "Assist in creating and setting budgets.",
        "Update and maintain financial records.",
        "Prepare spreadsheets for data entry, including budgets, accounting information, etc.",
        "Take direction from and report to the financial manager.",
        "Manage day-to-day accounting tasks such as data entry, billing, invoicing and payments.",
        "Provide stellar customer service to our clients and be informed on all company policy and practices (including data privacy).",
        "Review and audit financial statements/reports, ensures that all calculations and data entries are correct.",
        "Adhere to current accounting/finance standards and regulations."
    ],
    "desired_skills": [
        "Candidates must possess at least Diploma/Bachelor's Degree/Post Graduate Diploma/Professional Degree in Finance, Accounting or any related field",
        "Mathematical and accounting acuity.",
        "Professional demeanor, self-motivated, thrives under pressure, proactive and able to work independently.",
        "Knowledgeable in basic accounting/bookkeeping practices and processes",
        "Computer knowledge, experience using Microsoft Suite (Word, Excel etc.) and other accounting/data input software.",
        "Excellent communication and interpersonal skills.",
        "Strong organizational and time-management skills.",
        "Thrives working both independently and collaboratively.",
        "Highly dependable, respectful and consistently works to uphold company ethics and standards.",
        "Minimum of 1 year of working experience in related field."
    ]
}