{
  "title": "Head of Events",
  "slug": "head-of-events",
  "category": ["events"],
  "description_html": "<p>At Light Up 7, we collaborate with a diverse range of clients to deliver bold, results-driven solutions through digital marketing campaigns, media strategies, and immersive on-ground brand experiences.</p><p>We are looking for a highly organized and dynamic Head of Events to lead the planning, execution, and success of a wide range of events including brand activations, corporate events, product launches, and other large-scale event experiences. The Head of Events will manage all aspects of event logistics, from creative concept development to on-site and off-site execution, ensuring each event runs smoothly, meets objectives, and exceeds client expectations.</p><p>The ideal candidate is a proactive and strategic leader with exceptional communication and project management skills. You will serve as the key bridge between our clients and internal teams, delivering innovative event solutions while ensuring client satisfaction. If you thrive in a fast-paced, collaborative environment and are passionate about crafting memorable brand experiences, we want to hear from you.</p>",
  "responsibilities": [
    "<strong>Team Management:</strong><br> - Lead and coordinate all internal teams, outsourced volunteers, support staff, and external vendors.<br> - Train and guide event staff to ensure everyone is aligned with the event objectives.",
    
    "<strong>Event Planning & Coordination:</strong><br> - Work with clients to understand their vision, objectives, and budget for the event.<br> - Develop detailed event plans including proposals, timelines, budgets, and logistics.<br> - Oversee the vendor liaison process of the team (e.g., caterers, AV suppliers, venues) and negotiate contracts.<br> - Coordinate event setup, including staging, lighting, seating, and sound requirements.",
    
    "<strong>On-Site Management:</strong><br> - Oversee event day operations including registration, setup, catering, and breakdown.<br> - Ensure smooth event flow by addressing and resolving any on-site issues.<br> - Act as the primary point of contact for vendors, staff, and clients during events.<br> - Ensure all team members are properly briefed, aligned on responsibilities, and execute their tasks efficiently.",
    
    "<strong>Budget Management:</strong><br> - Prepare and manage event budgets, track expenses, and ensure financial objectives are met.<br> - Provide regular reports to stakeholders on the financial status of events.",
    
    "<strong>Marketing & Promotion:</strong><br> - Collaborate with internal teams to develop promotional strategies for events.<br> - Oversee the creative team's development of all promotional and printed materials, conducting quality checks as needed (e.g., invitations, brochures, social media content, buntings, and more).",
    
    "<strong>Post-Event Evaluation:</strong><br> - Gather feedback from clients, attendees, and team members to evaluate the event’s success.<br> - Prepare post-event reports detailing successes, lessons learned, and recommendations for future events."
  ],
  "desired_skills": [
    "Proven experience as an Event Manager, Senior Events Specialist, Head of Events or similar role.",
    "Strong project management skills and ability to manage multiple events simultaneously.",
    "Excellent communication and negotiation skills.",
    "Ability to work well under pressure and handle last-minute changes.",
    "Knowledge of event planning and marketing techniques.",
    "Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Google Suite (Docs, Sheets, Slides).",
    "Proficient in Adobe Illustrator for creating event floor plans and adjusting artwork for print.",
    "Budgeting and financial management skills.",
    "Proficiency in related event management software.",
    "Flexibility to work evenings, weekends, or holidays as required.",
    "Must have their own car and know how to drive."
  ]
}
