{
    "title": "HR & Admin Executive",
    "slug": "hr-admin-executive",
    "category": ["operations"],
    "description_html": "<p>We are on the lookout for a dedicated and enthusiastic HR & Admin Executive to support the growth of our business in the dynamic world of digital marketing. In this role, you’ll be at the heart of our operations. Managing key administrative functions and fostering a positive and productive work environment. You’ll work closely with our team to ensure smooth HR processes, efficient office management, and a great employee experience.</p><p>With a proactive mindset and strong people skills, you'll help maintain our company culture while supporting the needs of a growing team. If you are detail-oriented, organized, and passionate about building a thriving workplace, we’d love to hear from you!</p><p>Fresh graduates are also welcome to apply.</p>",
    "responsibilities": [
      "Assist HR department in handling end-to-end recruitment process including job postings, screening, interview coordination, and onboarding.",
      "Maintain and update employee records and HR databases.",
      "Assist in managing leave records, and attendance tracking.",
      "Assist in employee engagement activities and welfare programs.",
      "Support performance appraisal and confirmation processes.",
      "Ensure compliance with labor laws and internal HR policies.",
      "Assist in overseeing and managing the full spectrum of administration functions, including office management, operations, maintenance, and documentation.",
      "Assist in coordinating meetings, schedules, travel arrangements, and company events.",
      "Assist in procurement and inventory control of office supplies.",
      "Assist in liaising with vendors, service providers, and building management.",
      "Any ad-hoc duties and responsibilities as needed."
    ],
    "desired_skills": [
      "Diploma or Degree in Administration, Human Resources, Business Administration, or related field.",
      "Any relevant experience in HR and admin roles.",
      "Proficient in English and Malay (spoken and written).",
      "Proficient in MS Office (Word, Excel, PowerPoint).",
      "Strong communication and interpersonal skills.",
      "High level of integrity, responsibility, and confidentiality.",
      "Possesses own car and able to drive."
    ]
  }
  