{
    "title": "Internship",
    "slug": "internship",
    "category": ["internship"],
    "description_html": "<p>Light Up 7 offers internship positions to join our team. At our fast-paced, progressive digital agency we work with large, well-known brands and growing businesses to deliver compelling, ROI-driven marketing campaigns that create significant results.</p><p>We are looking for team players who are passionate in their fields of studies and are willing to learn and implement their skills to further their career experience.</p>",
    "responsibilities": [
        "<strong>Videographer / Video Editor:</strong> <br>Responsible for capturing and editing video content for various purposes, such as promotional videos, interviews, and event coverage. They work closely with the creative team, learning to operate video equipment, edit footage, and enhance the visual storytelling of projects while gaining practical experience in videography and video editing techniques.", 
        "[FULL] <strong>Graphic Designer:</strong><br>Collaborates with the design team to create visual assets for various marketing materials, websites, and social media platforms. Assist in the conceptualization and execution of design projects, while gaining hands-on experience in graphic design software and honing their artistic skills.",
        "[FULL] <strong>Event:</strong> <br>Assists in the planning, coordination, and execution of various physical/virtual/hybrid events. Work closely with event managers to handle logistics, communicate with vendors and attendees, and ensure smooth operations, gaining valuable experience in event management. *Must be able to drive car as the main means of transportation*",
        "[FULL] <strong>Web Designer / Developer:</strong> <br>Assists in designing and developing visually appealing and functional websites. Collaborate with the web development team, and learn web design principles, coding languages, and user experience (UX) concepts. Gain hands-on experience in web development!",
        "[FULL] <strong>Social Media Intern:</strong> <br>Supports the creative team in producing engaging digital content by assisting with shooting, editing, and social media materials, gaining hands-on experience in content creation and digital marketing.", 
        "[FULL] <strong>IT:</strong> <br>Assists in the maintenance and management of software, hardware, and IT assets. Supports the team with troubleshooting technical issues, setting up equipment, and ensuring smooth day-to-day operations of IT systems. Gains practical experience in IT support, asset management, and basic network administration.", 
        "[FULL] <strong>Finance:</strong> <br>Assist the finance department in various tasks, including financial analysis, data entry, claims and preparing financial reports. Gain practical experience in areas such as budgeting, bookkeeping and financial management, while contributing to the overall financial operations of the organization.",
        "[FULL] <strong>Copywriter/ Content Writer:</strong> <br>Responsible for creating engaging and informative written content for various platforms such as websites, blogs, and social media. Work closely with the team to develop their writing skills and gain practical experience in the field of content creation.",
        "[FULL] <strong>Motion Artist (2D/3D):</strong> <br>Specialise in creating dynamic and visually captivating 2D/3D motion graphics or animations. Work closely with the creative team to bring concepts to life through 3D or animation, utilizing a variety of software to gain practical experience in the field of motion art.",
        "[FULL] <strong>Digital Marketing:</strong> <br>Support the marketing team in implementing and optimizing digital marketing strategies to increase brand awareness and drive online engagement. Assist in managing social media accounts, organizing reports, conducting market research, and analyzing data to gain insights into consumer behavior and campaign effectiveness.",
        "[FULL] <strong>VFX / CGI:</strong> <br>Specialise in creating visual effects (VFX) and computer-generated imagery (CGI) for film, television, and other media. Work closely with the creative team, utilizing a variety of software and techniques to create realistic and stunning visual elements.",
        "[FULL] <strong>Illustrator / Artist:</strong> <br>Bring ideas to life through visual storytelling and creative illustrations. Work closely with the creative department, develop artistic skills and use various mediums to create captivating illustrations for all platforms."
    ]
}