{
    "title": "Junior Project Manager",
    "slug": "junior-project-manager",
    "category": ["finance/accounting"],
    "description_html": "<p>Light Up 7 is looking for a Junior Project Manager to join our marketing team. At our fast-paced, progressive digital agency we work with large, well-known brands and growing businesses to deliver compelling, ROI-driven marketing campaigns that create significant results.</p><p>We are looking for a team player that is passionate about executing cutting edge campaigns and managing large high-profile projects.. The ideal candidate will have 1-2+ years of experience and strong critical thinking skills with an exceptional ability to collaborate in a fast-paced, team-oriented environment.</p><p>This is a full time position. We are looking for a responsible, dedicated, career-minded professional.</p>",
    "responsibilities": [
        "Fully understand the client objectives and project goals and articulate them clearly",
        "Develop project plans and work with project teams to execute on plans",
        "Monitor day-to-day activities of project teams and ensure work is progressing as planned",
        "Manage schedules, budgets, assets, and overall project organization to ensure requirements and project deliverables dates are clearly communicated, understood, and executed upon",
        "Manage resource assignments to the project, and proactively identify resource challenges",
        "Actively monitor project risks and scope creep to foresee/identify potential problems and proactively identify solutions to address them in advance",
        "Consistently identify needs that clients may not recognize and ensure approaches and solutions are linked to objectives and future needs",
        "Consistently manage client expectations, ensure delivery of the highest quality service, and solicit and act on client feedback",
        "Communicate and document project status to clients, team members, and management on a regular basis; escalate issues accordingly via the appropriate channels",
        "Create and manage functional specs documentation along with project team members",
        "Recap and create debriefs for every completed project; facilitate discussions on lessons learned and new knowledge gained; document properly and share",
        "Prepare project documents such as SLAs, NDAs, execution plans, etc."
    ],
    "desired_skills": [
        "1-2+ years Digital Agency Project Management Experience",
        "Experience with managing projects, especially design, video, digital marketing and development of websites",
        "Excellent verbal, written, presentation and interpersonal communication skills",
        "Self-motivated, detail-oriented",
        "Level-headed and positive attitude under pressure",
        "A passion for learning new skills",
        "Strong web and desktop skills - we use Microsoft Office, Adobe Creative Suite, Google Docs, and various web-based tools",
        "Excellent Communication and Client Relations Skills",
        "A keen interest in the digital industry",
        "A desire to stay updated with the latest digital platforms and technology",
        "Responsible, organised, with attention to detail",
        "Outstanding communication skills, both oral and written",
        "Required skill(s): Presentation Skills, Problem Solving Technique, Microsoft Office",
        "Required language(s): English, Bahasa Malaysia"
    ]
}