{
    "title": "Motion Artist (2D/3D) Internship",
    "slug": "motion-artist-internship",
    "category": ["creative","internship"],
    "description_html": "<p>You will work closely with the graphic design and marketing departments to deliver engaging content that meets the expectations of our clients. You should be extremely creative, dedicated, possess excellent written and verbal communication skills.</p>",
    "responsibilities": [
      "Work closely with Project Director and other teams to concept, prototype, create, test, and integrate high-quality VFX.",
      "Develop unique animations from provided resources or entirely from scratch.",
      "Edit videos, including motion graphics animations, music, color grading, cinema graphs, and GIFs.",
      "Design and create enticing 2D/3D graphics for video deliverables (corporate videos, eLearning, websites, marketing demos, etc.).",
      "Create and deliver 2D/3D graphics in various media including web, mobile, etc.",
      "Assist in selecting audio, video, colors, animation, etc for graphic design.",
      "Work with editors, producers, and other designers to resolve technical and/or design issues.",
      "Edit raw video footage and add effects/elements to enhance motion graphics and 2D/3D elements.",
      "Research and analyze the best design techniques and solutions to create motion graphics.",
      "Assist in designing and creating storyboards.",
      "Participate in brainstorming sessions to share new design perspectives and ideas.",
      "Maintain up-to-date knowledge about the latest graphic design techniques."
    ],
    "desired_skills": [
      "Studying Diploma/Advanced/Higher/Graduate Diploma, Bachelor’s Degree/Post Graduate Diploma/Professional Degree in Art/Design/Creative Multimedia or equivalent courses.",
      "Adobe After Effects and Premiere; Knowledge of Photoshop, and Pro Tools or any other 2D/3D software.",
      "Strong artistic sensibility.",
      "Excellent Interpersonal skills."
    ]
}