{
    "title": "Senior Event Coordinator",
    "slug": "senior-event-coordinator",
    "category": ["events"],
    "description_html": "<p>We are searching for an enthusiastic Senior Event Coordinator with a \"can-do\" attitude to assist our team in hosting virtual and physical events. The ideal candidate must possess exceptional organizational abilities, superb interpersonal skills, ability to multi-task and excellent time management.</p><p> You will work closely with the Project Management team to host engaging events that will play a huge part in the success of our client’s campaigns, their brand identity and visibility. The noteworthy Senior Event Coordinator will effectively deliver event objectives and manage the whole event process from start to finish.</p>",
    "responsibilities": [
      "Responsible for planning, production and management of all events.",
      "Acts as a key liaison between all parties including internal/external stakeholders in the event production and management process.",
      "Responsible for all event logistics and coordination.",
      "Actively coordinate and liaise with event management vendors (negotiating quotes and agreements)",
      "Onsite event management on rehearsal and ensure smooth event proceedings.",
      "Obtaining government and non-government event permits",
      "Monitor and updating event progress to ensure client satisfaction.",
      "Reporting status to management team for all events.",
      "Resolve and troubleshoot issues that emerge during the event day proactively.",
      "Propose, brainstorm and implement ideas to improve event services or quality",
      "Assist with the preparation of event proceedings, collaterals, briefing notes, duty list and any documents related to event production.",
      "Preparation of income and expenditure report and other applicable reports relating to each event.",
      "Handling post-event reports and survey forms.",
      "Ensuring each event is flawlessly executed.",
      "To work on other agency projects when required."
    ],
    "desired_skills": [
      "Candidate must possess at least Diploma/Advanced/Higher/Graduate Diploma, Bachelor's Degree/Post Graduate Diploma/Professional Degree in a related field",
      "At least 3-5 years experience in handling virtual or physical events.",
      "Experience in project management with a track record of successful events.",
      "Problem-solving skills and out-of-the-box thinker.",
      "Meticulous attention to detail.",
      "Excellent communication skills in English and Bahasa Melayu (Chinese is a bonus).",
      "Able to multi-task, work independently and work under pressure with minimum supervision."
    ]
}