{
    "title": "Senior Video Editor",
    "slug": "senior-video-editor",
    "category": ["video"],
    "description_html": "<p>We are in search of a Senior Video Editor to join our video production team. You will play an important role in the company’s success as videos are the best way of communicating the company’s and clients message on online platforms.</p><p>As the Senior Video Editor, you will oversee all video editing projects, from initial concept through final delivery. This role requires expert-level skills in DaVinci Resolve, including color grading, and leadership abilities to guide junior editors and maintain high standards of quality and brand alignment. You will be responsible for optimizing the video editing workflow and ensuring each project follows consistent organization and file management practices.</p><p>If you are a creative individual and have an eye for details, we would like to meet you. Please do not forget to send in your portfolio to us!</p>",
    "responsibilities": [
        "Lead the editing workflow by supervising junior editors, offering guidance and feedback to ensure quality and consistency across all video projects.",
        "Supervise and manage the editing process across all projects, ensuring organised folder structures, project files, and editing timelines are consistently in place.",
        "Trim, edit, and combine sequences of video footage according to the storyboard and brief from the creatives.",
        "Create a cohesive video narrative that aligns with brand messaging strategy and objectives.",
        "Prepare both rough and polished final cuts, maintaining high standards of quality and attention to detail.",
        "Continuously research and implement new editing techniques and industry best practices to increase efficiency and creativity in video production.",
        "Input effects, graphics, motion graphics and dialogues into the videos to make them more visually appealing.",
        "Insert music and necessary sound effects to the video clips.",
        "Manage to work both on-site as well as off-site locations.",
        "Collaborate with stakeholders from production to post-production process.",
        "Monitor and oversee all technical aspects of recording, editing, and exporting, ensuring all deliverables meet company standards and specifications.",
        "Work effectively with the team members."
    ],
    "desired_skills": [
        "2-4+ years of experience as a Video Editor, Video Specialist or similar role in Media Industry.",
        "2Advanced proficiency in colour grading in DaVinci Resolve is preferred.",
        "Solid experience of using video editing software like Adobe Premiere Pro.",
        "Strong Showreel or complete portfolio depicting the works undertaken so far.",
        "Creative thinker and excellent time management skills.",
        "Outstanding interpersonal and communication skills.",
        "Work both on and off-site and pull off long hours if production isn’t completed.",
        "Excellent teamwork skills, with the ability to work effectively with cross-functional teams."
    ]
}