{
  "title": "Senior Business Development Executive",
  "slug": "senior-business-development-executive",
  "category": ["client services"],
  "description_html": "<p>At Light Up 7, we’re looking for a passionate and driven individual to join our growing team and play a key role in driving business growth within the creative and digital landscape. As a brand activation agency, we collaborate with a diverse range of clients to deliver bold, results-driven solutions from digital campaigns and media strategies to immersive on-ground experiences.</p><p>In this role, you’ll actively identify new business opportunities, foster strong client relationships, and champion creative solutions that align with our clients' business goals. You’ll be the bridge between brands and our internal teams, ensuring client satisfaction while pushing creative boundaries. If you’re a strategic thinker who thrives in a fast-paced, collaborative environment and isn’t afraid to challenge the status quo, we want to hear from you.</p>",
  "responsibilities": [
    "Identifying and researching business opportunities that come up in new or existing markets.",
    "Communicating with clients to understand their needs and offer customized solutions to their problems.",
    "Attracting new clients by innovating and formulating advertising solutions for their business.",
    "Holding presentations and insightful pitches to attract potential clients.",
    "Preparing tailored proposals and quotations for potential clients.",
    "Assist in the Procurement process to register our company as a vendor.",
    "Following up with current and future clientele to offer marketing solutions to their problems.",
    "Collecting and analyzing current trends in the media to gather market information to identify opportunities to grow.",
    "To work closely with superiors in handling or attending any other duties relating to Business Development which may be assigned from time to time.",
    "Assisting superior in completing ad-hoc tasks & projects."
  ],
  "desired_skills": [
    "Bachelor’s degree in business, marketing or any related field.",
    "Experience in sales, marketing, business development or any related industries.",
    "Strong communication and negotiation skills.",
    "Ability to manage complex projects and multi-task.",
    "Excellent organizational skills and time management skills.",
    "Understanding of market research and analysis techniques.",
    "Independent, strong networking and relationship-building skills.",
    "Proficient in Microsoft Word, Excel, Outlook, and PowerPoint.",
    "Possesses own car and is able to drive."
  ]
}
