{
    "title": "Senior Videographer",
    "slug": "senior-videographer",
    "category": ["video"],
    "description_html": "<p>We are looking for a Senior Videographer to join our Video Production Team. You will play an important role in creating high-quality video content that brings stories to life across digital platforms.</p><p>As a Senior Videographer, a strong sense of storytelling, a keen eye for detail, and a commitment to delivering high-quality work are essential. You will focus on shooting, filming, and contributing to the production process, while mentoring junior team members and sharing expertise to ensure every project meets creative and brand standards. Strong skills in camera work, lighting, and directing, along with the ability to collaborate effectively with the team and maintain efficient workflows, are key to success in this role.</p><p>If you’re passionate about creating impactful visual content and have a portfolio that showcases your work, we’d love to see it!</p>",
    "responsibilities": [
        "Capture high-quality photographs and videos.",
        "Trim footage segments and combine sequences of the film.",
        "Develop and execute overall video brand messaging strategy.",
        "Prepare rough and final cuts for videos.",
        "Input effects, graphics, dialogues, and music into videos to enhance visual appeal.",
        "Insert music and necessary sound effects into video clips.",
        "Discover and implement new techniques and methods to maximize production efficiency.",
        "Work both on-site and off-site as required.",
        "Collaborate with stakeholders throughout the production and post-production process.",
        "Monitor all technical aspects of recording and editing.",
        "Work effectively with team members."
    ],
    "desired_skills": [
        "Showreel or website portfolio.",
        "2-4+ years of experience as a Videographer, Video Editor, Video Specialist or similar role in the Media Industry.",
        "A complete portfolio depicting previous work.",
        "Solid experience using video editing software such as Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve.",
        "Creative thinker with excellent time management skills.",
        "Outstanding interpersonal and communication skills.",
        "Able to work both on-site and off-site and commit to long hours when necessary to complete production.",
        "Strong teamwork skills and ability to collaborate effectively."
    ]
}
