{
    "title": "Senior Videographer/Video Editor",
    "slug": "senior-videographer-video-editor",
    "category": ["video"],
    "description_html": "<p>We are in search of a Videographer and Video Editor to join our video production team. You will be responsible for editing photos and producing videos from raw footages for external and internal purposes.</p><p>You will play an important role in the company’s success as videos are the best way of communicating the company’s and clients message on online platforms. You will be working directly with the producer and director. Hence, you should have an outstanding experience in editing and production.</p><p>If you are a creative individual and have an eye for details, we would like to meet you. Please do not forget to send in your portfolio to us!</p>",
    "responsibilities": [
        "Capture high-quality photographs and videos.",
        "Trim footage segments and combine the sequences of the film.",
        "Make an overall video brand messaging strategy.",
        "Prepare rough and final cuts for the videos.",
        "Input effects, graphics, dialogues, and music into the videos to make them more visually appealing.",
        "Insert music and necessary sound effects to the video clips.",
        "Discover and implement new techniques and methods to maximize the company’s efficiency.",
        "Manage to work both on-site as well as off-site locations.",
        "Collaborate with stakeholders from production to post-production process.",
        "Monitor all technical aspects of recording and editing.",
        "Work effectively with the team members."
    ],
    "desired_skills": [
        "Showreel or website portfolio.",
        "2-4+ years of experience as a Video Editor, Video Specialist or similar role in Media Industry.",
        "A complete portfolio depicting the works undertaken so far.",
        "Solid experience of using video editing software like Adobe Premier.",
        "Creative thinker and excellent time management skills.",
        "Outstanding interpersonal and communication skills.",
        "Work both on and off-site and pull off long hours if production isn’t completed.",
        "Able to work with a team."
    ]
}